import 'package:carousel_slider/carousel_slider.dart';
import 'package:flutter/material.dart';
import 'package:islamy_app/common/app_colors.dart';
import 'package:islamy_app/gen/assets.gen.dart';
import 'package:islamy_app/widgets/bg_build_widget.dart';

class HadeethTab extends StatelessWidget {
  const HadeethTab({super.key});

  @override
  Widget build(BuildContext context) {
    Size size = MediaQuery.sizeOf(context);
    return Stack(
      children: [
        BgBuildWidget(imagePath: Assets.images.hadeethBg.path),
        SafeArea(
          child: Column(
            children: [
              Center(child: Image.asset(Assets.images.appBarImage.path)),
              SizedBox(height: size.height * .03),
              Expanded(
                child: LayoutBuilder(
                  builder: (BuildContext context, BoxConstraints constraints) =>
                      CarouselSlider.builder(
                        itemCount: 20,

                        options: CarouselOptions(
                          height: constraints.maxHeight,
                          scrollDirection: Axis.horizontal,
                          autoPlay: true,
                          enlargeCenterPage: true,
                        ),
                        itemBuilder: (context, index, realIndex) => Card(
                          color: AppColors.goldColor,
                          shape: RoundedRectangleBorder(
                            borderRadius: BorderRadius.circular(20),
                          ),
                          child: Padding(
                            padding: const EdgeInsets.only(top: 10.0),
                            child: Stack(
                              
                              fit: StackFit.expand,
                              children: [
                                Image(
                                  image: AssetImage(
                                    Assets.images.hadeethCardBg.path,
                                  ),
                                  fit: BoxFit.fill,
                                ),
                                Padding(
                                  padding: const EdgeInsets.only(
                                    top: 20,
                                    left: 20,
                                    bottom: 60,
                                    right: 20,
                                  ),
                                  child: Column(
                                    spacing: 10,
                                    children: [
                                      Text(
                                        "data",
                                        style: TextStyle(
                                          fontSize: 24,
                                          fontWeight: .bold,
                                        ),
                                      ),

                                      Expanded(
                                        child: SingleChildScrollView(
                                          controller: ScrollController(),
                                          padding: EdgeInsets.all(20),
                                          child: Text(
                                            """
تم استخدام 95 من مساحة التخزين  نفدت مساحة التخزين، لن تتمكّني من إنشاء الملفات أو تعديلها أو تحميلها. احصلي على مساحة تخزين بسعة 30 غيغابايت مقابل .99 ج.م. بدلاً من .99 ج.م. لمدة 3 أشهر.
100
﻿﻿الحد يث الأول
 عن أمـيـر المؤمنـين أبي حـفص عمر بن الخطاب رضي الله عنه ، قال : سمعت رسول الله صلى الله عـليه وسلم يـقـول : ( إنـما الأعـمـال بالنيات وإنـمـا لكـل امـرئ ما نـوى . فمن كـانت هجرته إلى الله ورسولـه فهجرتـه إلى الله ورسـوله ومن كانت هجرته لـدنيا يصـيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ).
رواه إمام المحد ثين أبـو عـبـد الله محمد بن إسماعـيل بن ابراهـيـم بن المغـيره بن بـرد زبه البخاري الجعـفي،[رقم:1] وابـو الحسـيـن مسلم بن الحجاج بن مـسلم القـشـيري الـنيسـابـوري [رقم :1907] رضي الله عنهما في صحيحيهما اللذين هما أصح الكتب المصنفه. تم استخدام 95 من مساحة التخزين … ‏إذا نفدت مساحة التخزين، لن تتمكّني من إنشاء الملفات أو تعديلها أو تحميلها. احصلي على مساحة تخزين بسعة 30 غيغابايت مقابل .99 ج.م.‏ بدلاً من ‎‏41.99 ج.م.‏ لمدة 3 أشهر.
100
﻿﻿الحد يث الأول
 عن أمـيـر المؤمنـين أبي حـفص عمر بن الخطاب رضي الله عنه ، قال : سمعت رسول الله صلى الله عـليه وسلم يـقـول : ( إنـما الأعـمـال بالنيات وإنـمـا لكـل امـرئ ما نـوى . فمن كـانت هجرته إلى الله ورسولـه فهجرتـه إلى الله ورسـوله ومن كانت هجرته لـدنيا يصـيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ).
رواه إمام المحد ثين أبـو عـبـد الله محمد بن إسماعـيل بن ابراهـيـم بن المغـيره بن بـرد زبه البخاري الجعـفي،[رقم:1] وابـو الحسـيـن مسلم بن الحجاج بن مـسلم القـشـيري الـنيسـابـوري [رقم :1907] رضي الله عنهما في صحيحيهما اللذين هما أصح الكتب المصنفه. تم استخدام 95 من مساحة التخزين … ‏إذا نفدت مساحة التخزين، لن تتمكّني من إنشاء الملفات أو تعديلها أو تحميلها. احصلي على مساحة تخزين بسعة 30 غيغابايت مقابل .99 ج.م.‏ بدلاً من ‎‏41.99 ج.م.‏ لمدة 3 أشهر.
100
﻿﻿الحد يث الأول
 عن أمـيـر المؤمنـين أبي حـفص عمر بن الخطاب رضي الله عنه ، قال : سمعت رسول الله صلى الله عـليه وسلم يـقـول : ( إنـما الأعـمـال بالنيات وإنـمـا لكـل امـرئ ما نـوى . فمن كـانت هجرته إلى الله ورسولـه فهجرتـه إلى الله ورسـوله ومن كانت هجرته لـدنيا يصـيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ).
رواه إمام المحد ثين أبـو عـبـد الله محمد بن إسماعـيل بن ابراهـيـم بن المغـيره بن بـرد زبه البخاري الجعـفي،[رقم:1] وابـو الحسـيـن مسلم بن الحجاج بن مـسلم القـشـيري الـنيسـابـوري [رقم :1907] رضي الله عنهما في صحيحيهما اللذين هما أصح الكتب المصنفه. تم استخدام 95 من مساحة التخزين … ‏إذا نفدت مساحة التخزين، لن تتمكّني من إنشاء الملفات أو تعديلها أو تحميلها. احصلي على مساحة تخزين بسعة 30 غيغابايت مقابل .99 ج.م.‏ بدلاً من ‎‏41.99 ج.م.‏ لمدة 3 أشهر.
100
﻿﻿الحد يث الأول
 عن أمـيـر المؤمنـين أبي حـفص عمر بن الخطاب رضي الله عنه ، قال : سمعت رسول الله صلى الله عـليه وسلم يـقـول : ( إنـما الأعـمـال بالنيات وإنـمـا لكـل امـرئ ما نـوى . فمن كـانت هجرته إلى الله ورسولـه فهجرتـه إلى الله ورسـوله ومن كانت هجرته لـدنيا يصـيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ).
رواه إمام المحد ثين أبـو عـبـد الله محمد بن إسماعـيل بن ابراهـيـم بن المغـيره بن بـرد زبه البخاري الجعـفي،[رقم:1] وابـو الحسـيـن مسلم بن الحجاج بن مـسلم القـشـيري الـنيسـابـوري [رقم :1907] رضي الله عنهما في صحيحيهما اللذين هما أصح الكتب المصنفه. تم استخدام 95 من مساحة التخزين … ‏إذا نفدت مساحة التخزين، لن تتمكّني من إنشاء الملفات أو تعديلها أو تحميلها. احصلي على مساحة تخزين بسعة 30 غيغابايت مقابل .99 ج.م.‏ بدلاً من ‎‏41.99 ج.م.‏ لمدة 3 أشهر.
100
﻿﻿الحد يث الأول
 عن أمـيـر المؤمنـين أبي حـفص عمر بن الخطاب رضي الله عنه ، قال : سمعت رسول الله صلى الله عـليه وسلم يـقـول : ( إنـما الأعـمـال بالنيات وإنـمـا لكـل امـرئ ما نـوى . فمن كـانت هجرته إلى الله ورسولـه فهجرتـه إلى الله ورسـوله ومن كانت هجرته لـدنيا يصـيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ).
رواه إمام المحد ثين أبـو عـبـد الله محمد بن إسماعـيل بن ابراهـيـم بن المغـيره بن بـرد زبه البخاري الجعـفي،[رقم:1] وابـو الحسـيـن مسلم بن الحجاج بن مـسلم القـشـيري الـنيسـابـوري [رقم :1907] رضي الله عنهما في صحيحيهما اللذين هما أصح الكتب المصنفه. تم استخدام 95 من مساحة التخزين … ‏إذا نفدت مساحة التخزين، لن تتمكّني من إنشاء الملفات أو تعديلها أو تحميلها. احصلي على مساحة تخزين بسعة 30 غيغابايت مقابل .99 ج.م.‏ بدلاً من ‎‏41.99 ج.م.‏ لمدة 3 أشهر.
100
﻿﻿الحد يث الأول
 عن أمـيـر المؤمنـين أبي حـفص عمر بن الخطاب رضي الله عنه ، قال : سمعت رسول الله صلى الله عـليه وسلم يـقـول : ( إنـما الأعـمـال بالنيات وإنـمـا لكـل امـرئ ما نـوى . فمن كـانت هجرته إلى الله ورسولـه فهجرتـه إلى الله ورسـوله ومن كانت هجرته لـدنيا يصـيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ).
رواه إمام المحد ثين أبـو عـبـد الله محمد بن إسماعـيل بن ابراهـيـم بن المغـيره بن بـرد زبه البخاري الجعـفي،[رقم:1] وابـو الحسـيـن مسلم بن الحجاج بن مـسلم القـشـيري الـنيسـابـوري [رقم :1907] رضي الله عنهما في صحيحيهما اللذين هما أصح الكتب المصنفه. 
""",
                                            style: TextStyle(
                                              fontSize: 16,
                                              fontWeight: .bold,
                                            ),
                                          ),
                                        ),
                                      ),
                                    ],
                                  ),
                                ),
                              ],
                            ),
                          ),
                        ),
                      ),
                ),
              ),
              SizedBox(height: 20),
            ],
          ),
        ),
      ],
    );
  }
}
